In [1]:
import pandas as pd

In [ ]:
df = pd.read_csv("stock_data.csv")
df.head()

,Datasource: Google finance,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,tickers,eps,revenue,price,people
1,GOOGL,27.82,87,845,larry page
2,WMT,4.61,484,65,n.a.
3,MSFT,-1,85,64,bill gates
4,RIL,not available,50,1023,mukesh ambani

In [6]:
df = pd.read_csv("stock_data.csv", skiprows=1)
df.head()

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [9]:
df = pd.read_csv("stock_data.csv", header=1)
df.head()

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [12]:
df = pd.read_csv("stock_data.csv", header=1, names=['stock_code','eps','revenue','price','people'], nrows=3)
df

  stock_code    eps  revenue  price      people
0      GOOGL  27.82       87    845  larry page
1        WMT   4.61      484     65        n.a.
2       MSFT  -1.00       85     64  bill gates

In [13]:
df = pd.read_csv("stock_data.csv", header=1, names=['stock_code','eps','revenue','price','people'], na_values={
    'eps':['not available'][-1],
    'revenue':[-1],
    'price':['n.a.']

})
df

  stock_code    eps  revenue   price         people
0      GOOGL  27.82     87.0   845.0     larry page
1        WMT   4.61    484.0    65.0           n.a.
2       MSFT  -1.00     85.0    64.0     bill gates
3       RIL     NaN     50.0  1023.0  mukesh ambani
4       TATA   5.60      NaN     NaN     ratan tata

In [14]:
df = pd.read_csv("stock_data.csv", header=1, names=['stock_code','eps','revenue','price','people'], na_values=['not available',-1,'n.a.'])
df

  stock_code    eps  revenue   price         people
0      GOOGL  27.82     87.0   845.0     larry page
1        WMT   4.61    484.0    65.0            NaN
2       MSFT    NaN     85.0    64.0     bill gates
3       RIL     NaN     50.0  1023.0  mukesh ambani
4       TATA   5.60      NaN     NaN     ratan tata